JonHub/attoDuino/boards.txt
#atto - added from energia’s boards.txt
##############################################################
tmp4c123g.name=AttoDuino Pro BT
tmp4c123g.upload.maximum_size=262144
tmp4c123g.build.mcu=cortex-m4
tmp4c123g.build.f_cpu=80000000L
tmp4c123g.build.core=lm4f
tmp4c123g.build.variant=stellarpad
#atto, should say build.
#tmp4c123g.ldscript=lm4fcpp_blizzard.ld
tmp4c123g.build.ldscript=lm4fcpp_blizzard.ld
tmp4c123g.upload.maximum_ram_size=32768
##############################################################


## for reference
arduino_due_x_dbg.name=Arduino Due (Programming Port)
arduino_due_x_dbg.vid.0=0x2341
arduino_due_x_dbg.pid.0=0x003d
arduino_due_x_dbg.upload.tool=bossac
arduino_due_x_dbg.upload.protocol=sam-ba
arduino_due_x_dbg.upload.maximum_size=524288
arduino_due_x_dbg.upload.use_1200bps_touch=true
arduino_due_x_dbg.upload.wait_for_upload_port=false
arduino_due_x_dbg.upload.native_usb=false
arduino_due_x_dbg.build.mcu=cortex-m3
arduino_due_x_dbg.build.f_cpu=84000000L
arduino_due_x_dbg.build.usb_product="Arduino Due"
arduino_due_x_dbg.build.board=SAM_DUE
arduino_due_x_dbg.build.core=arduino
arduino_due_x_dbg.build.extra_flags=-D__SAM3X8E__ -mthumb {build.usb_flags}
arduino_due_x_dbg.build.ldscript=linker_scripts/gcc/flash.ld
arduino_due_x_dbg.build.variant=arduino_due_x
arduino_due_x_dbg.build.variant_system_lib=libsam_sam3x8e_gcc_rel.a
arduino_due_x_dbg.build.vid=0x2341
arduino_due_x_dbg.build.pid=0x003e